doc/blog/covid19-pubseq-location-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-09 Fri 04:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>COVID-19 PubSeq Location Data</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pjotr Prins" />
<link rel="Blog stylesheet" type="text/css" href="blog.css" />
</head>
<body>
<div id="content">
<h1 class="title">COVID-19 PubSeq Location Data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdae1021">1. Introduction</a></li>
<li><a href="#org4faca08">2. Location data</a></li>
<li><a href="#orgf2e9a65">3. Normalizing location data</a></li>
<li><a href="#orgb1426c2">4. Missing data</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdae1021" class="outline-2">
<h2 id="orgdae1021"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Normalized location metadata is one of the important features
of PubSeq. In this document we explain why it is not so easy!
</p>
</div>
</div>

<div id="outline-container-org4faca08" class="outline-2">
<h2 id="org4faca08"><span class="section-number-2">2</span> Location data</h2>
<div class="outline-text-2" id="text-2">
<p>
When data gets uploaded to central repositories some metadata needs to
be provided about sampling location and uploader (lab) location. This
should be straightforward. Yeah, right.
</p>

<p>
The main problem, probably, is that central repositories can not be
strict about these parameters - otherwise uploads fail and uploaders
get annoyed (and may stop uploading). This basic problem is about
human expectation.
</p>

<p>
The other problem is that not everything is fixed to a site. What to
to make of the location `USA: Cruise_Ship_1, California' in <a href="https://www.ncbi.nlm.nih.gov/nuccore/MT810507">MT810507</a>.
From the full record we best place the sample on San Diego.
</p>

<p>
There exist many opportunities for ambiguous entries, such as Memphis
TN and Memphis IN. We decided to settle for Wikidata URIs because (1)
they are not ambiguous and (2) allow for fetching more information,
such as population size, density, county and GPS location. See the
wikidata entries for <a href="https://www.wikidata.org/wiki/Q2447864">Memphis Tennessee</a>, <a href="https://www.wikidata.org/wiki/Q2699142">Memphis Indiana</a>, <a href="https://www.wikidata.org/wiki/Q979971">Memphis Texas</a>
<a href="https://www.wikidata.org/wiki/Q1890251">Memphis Michigan</a> and <a href="https://www.wikidata.org/wiki/Q3289795">Memphis Nebraska</a>. And then there is the original
<a href="https://www.wikidata.org/wiki/Q5715">Memphis Egypt</a>, ancient capital of Aneb-Hetch.
</p>
</div>
</div>

<div id="outline-container-orgf2e9a65" class="outline-2">
<h2 id="orgf2e9a65"><span class="section-number-2">3</span> Normalizing location data</h2>
<div class="outline-text-2" id="text-3">
<p>
Wikidata
</p>
</div>
</div>

<div id="outline-container-orgb1426c2" class="outline-2">
<h2 id="orgb1426c2"><span class="section-number-2">4</span> Missing data</h2>
<div class="outline-text-2" id="text-4">
<p>
After normalization, the original data we maintain in a field
`collection_location_original'. If we can normalize to a Wikidata
entry URI that is stored in `collection_location'.  Otherwise it is
missing (RDF favours treating missing data as really missing data).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><small>Created by <a href="http://thebird.nl/">Pjotr Prins</a> (pjotr.public768 at thebird 'dot' nl) using Emacs org-mode and a healthy dose of Lisp!<br />Modified 2021-04-09 Fri 04:05</small>.
</div>
</body>
</html>
